# GetValueAsColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray4d..::..GetValueAsColor Method
AssetPropertyDoubleArray4d Class See Also
---
Gets the value property as a color.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Color GetValueAsColor()
```

Visual Basic
---
```text
Public Function GetValueAsColor As Color
```

Visual C++
---
```text
public:
Color^ GetValueAsColor()
```

# ### Return Value
The color value.
# See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace